<template>
    <main class="content-wrapper">
        <fixed-background :imgSrc="'circuit-board-bg.png'" />
        <div class="page-title">Теория</div>

        <div class="flex-center" style="flex-direction: column; gap: 1.5rem">
            <div class="white-round">
                <h3 style="margin-bottom: 0">Материал из <a class="link"
                        href="https://ru.wikipedia.org/wiki/Твердотельный_накопитель">
                        Википедии</a> — свободной энциклопедии</h3>
            </div>

            <div class="white-round" style="margin-bottom: 1.5rem; max-width: 40rem">
                <p>
                    <span class="bold">Твердотельный накопитель</span>
                    (англ. Solid-State Drive, SSD) — компьютерное энергонезависимое немеханическое запоминающее
                    устройство на основе микросхем памяти, альтернатива жёстким дискам (HDD).
                </p>
            </div>
        </div>

        <div v-if="!$store.state.isMobile" class='flex-center'
            style="align-items: stretch; width: fit-content; margin: 0 auto; gap: 1.5rem">


            <!--DESKTOP-->
            <!--FIRST COLUMN-->
            <article class="flex-column" style="width: 50%">
                <div class="white-round">
                    <p>
                        Наиболее распространённый вид твердотельных накопителей использует для хранения информации
                        флеш-память типа NAND, однако существуют варианты, в которых накопитель создаётся на базе
                        DRAM-памяти, снабжённой дополнительным источником питания — аккумулятором. Помимо собственно
                        микросхем памяти, подобный накопитель содержит управляющую микросхему — контроллер.
                    </p>
                </div>

                <card class="card" v-for="i in [0, 2, 3]" :imgSrc="cards[i].imgSrc" :title="cards[i].title" />

                <div class="white-round">
                    <p>
                        Проблему решают твердотельные накопители — они обеспечивают намного большие скорости работы с
                        данными по сравнению с жёсткими дисками. SSD за счёт использования микросхем флеш-памяти по
                        своим
                        характеристикам существенно отличаются от жёстких дисков с магнитными пластинами.
                    </p>
                </div>

                <div class="white-round">
                    <h3>Основные характеристики твердотельных накопителей</h3>
                    <ul>
                        <li>Наименьшее время доступа к данным: от ста до тысячи раз быстрее, чем у механических дисков
                        </li>
                        <li>Высокая скорость, вплоть до нескольких Гб/с для произвольно расположенных данных</li>
                        <li>Высокие значения IOPS благодаря высокой скорости и низкому времени доступа</li>
                        <li>Низкая цена производительности, лучшее соотношение цены к производительности среди всех
                            устройств хранения</li>
                        <li>Высокая надёжность; SSD дают уровень сохранности данных такой же, как другие
                            полупроводниковые
                            устройства</li>
                    </ul>
                </div>

                <div class="white-round">
                    <h3>Внешние накопители</h3>
                    <p>
                        Первоначально твердотельные накопители распространились в виде отдельных устройств накопления и
                        переноса
                        информации. Они подключались к компьютерам и цифровым гаджетам через ряд стандартизированных
                        внешних
                        интерфейсов, а конструкция накопителей позволяла неквалифицированному пользователю безопасно
                        манипулировать ими и переносить данные между устройствами. Все эти накопители можно было
                        разделить
                        на
                        две большие группы: с интерфейсом USB («USB-флешки»), преимущественно используемые с
                        компьютерами, и
                        карты памяти, преимущественно используемые в разнообразных электронных гаджетах, например
                        цифровых
                        фотоаппаратах, телефонах и т. п.

                        USB-накопители были отлично стандартизированы и обеспечивали работоспособность на любых
                        устройствах
                        с
                        этим разъёмом. Карты памяти имели большое разнообразие несовместимых конструкций и интерфейсов.
                        Первоначально были популярны CompactFlash, SmartMedia, Memory Stick, MMC, SD.
                    </p>
                </div>

                <card class="card" v-for="i in [6]" :imgSrc="cards[i].imgSrc" :title="cards[i].title" />

                <div class="white-round">
                    <p>
                        По мере роста ёмкости и удешевления флеш-памяти, твердотельная память стала заменять основную
                        долговременную память компьютеров — жёсткие диски. С целью обеспечения взаимозаменяемости с
                        существовавшими технологиями встраиваемые твердотельные накопители стали выпускать в
                        стандартизированных для жёстких дисков конструктивах и с наиболее популярным на тот момент
                        интерфейсом для жёстких дисков. Так появились твердотельные диски типоразмера 2,5" с интерфейсом
                        SATA, которые устанавливались вместо механических жёстких дисков.

                    </p>
                </div>

                <div class="white-round">
                    <p>
                        Несмотря на похожий конструктив накопители M.2 SATA нельзя установить вместо M.2 NVMe и M.2 NVMe
                        нельзя установить вместо M.2 SATA, они несовместимы друг с другом. Внешне их можно различить по
                        количеству вырезов на контактах платы накопителя и соответствующих ключевых вставок на ответном
                        разъёме: у M.2 SATA их два, а у M.2 NVMe — один.
                    </p>
                </div>

                <div class="white-round">
                    <h3>Преимущества</h3>
                    <ul>
                        <li>Количество произвольных операций ввода-вывода в секунду (IOPS) у SSD на порядок выше, чем у
                            жёстких дисков, за счёт возможности одновременного запуска множества операций и более низкой
                            латентности каждой операции</li>
                        <li>Скорость линейного чтения/записи выше, чем у распространённых жёстких дисков, и в ряде
                            операций
                            может быть близка к пропускной способности интерфейсов (SAS/SATA III 600 МБ/с)</li>
                        <li>Малые габариты и вес. Для твердотельных накопителей были разработаны более компактные
                            типовые
                            размеры, например mSATA, NGFF (M.2)</li>
                        <li>Стабильность времени считывания файлов вне зависимости от их расположения или фрагментации
                        </li>
                        <li>Полное отсутствие шума</li>
                        <li>Высокая механическая стойкость (кратковременно выдерживают порядка 1500 g)</li>
                        <li>Низкое энергопотребление</li>
                        <li>Намного меньшая чувствительность к внешним электромагнитным полям</li>
                        <li>Более высокая по сравнению с HDD надёжность при долговременном использовании в качестве
                            загрузочного диска
                        </li>
                    </ul>
                </div>

                <div class="white-round">
                    <h3>Перспективы развития</h3>
                    <p>
                        Главный недостаток SSD-накопителей на базе флеш-памяти — ограниченное число циклов перезаписи;
                        при
                        развитии технологий изготовления энергонезависимой памяти, возможно, будет устранён путём
                        изготовления носителя информации по другим физическим принципам, например FeRam, ReRAM
                        (resistive
                        random-access memory) и др.
                    </p>
                </div>
            </article>

            <!--SECOND COLUMN-->

            <article class="flex-column" style="width: 50%">
                <div class="white-round">
                    <p>
                        По сравнению с традиционными жёсткими дисками твердотельные накопители имеют меньший размер и
                        вес, являются бесшумными, а также многократно более устойчивы к повреждениям (например, при
                        падении) и имеют гораздо большую скорость производимых операций. В то же время, они имеют в
                        несколько раз большую стоимость в пересчёте на гигабайт и меньшую износостойкость (ресурс
                        записи). В настоящее время твердотельные накопители используются как в носимых (ноутбуках,
                        нетбуках, планшетах), так и в стационарных компьютерах для повышения производительности. На 2016
                        год наиболее производительными выступали SSD формата M.2 с интерфейсом NVMe, у которых при
                        подходящем подключении скорость записи/чтения данных могла достигать 3800 мегабайт в секунду.
                    </p>
                </div>

                <card class="card" v-for="i in [1, 4]" :imgSrc="cards[i].imgSrc" :title="cards[i].title" />

                <div class="white-round">
                    <p>
                        SSD представляют собой устройства, хранящие данные в микросхемах вместо вращающихся
                        металлических
                        дисков или магнитных лент. Причина их появления отражает тот факт, что скорость обработки данных
                        в
                        процессоре намного превышает скорость записи данных в HDD. Магнитные диски на протяжении
                        десятилетий
                        доминировали в корпоративном сегменте хранения данных, за это время (с 1950-х) ёмкость носителей
                        выросла в двести тысяч раз, скорость работы процессоров тоже сильно возросла, но скорость
                        доступа
                        к данным изменилась значительно меньше и диски стали «узким местом».
                    </p>
                </div>

                <div class="white-round">
                    <p>
                        С целью оптимизации использования SSD в 2011 году был разработан интерфейс NVMe — англ.
                        Non-Volatile
                        Memory Express, поддержка которого была добавлена в Windows, начиная только с версии 8.1.
                        Не все материнскиеплаты поддерживают интерфейс NVMe, поэтому всё ещё сохраняет популярность
                        старый интерфейс SATA.
                    </p>
                </div>

                <div class="white-round">
                    <h3>Гибридные накопители</h3>
                    Существуют также <span class="bold">гибридные жёсткие диски </span> (англ. SSHD, solid-state hybrid
                    drive), в которых совмещена
                    твердотельная память и механический жёсткий диск. Подобное объединение позволяет воспользоваться
                    частью преимуществ флеш-памяти (быстрый произвольный доступ) при сохранении небольшой стоимости
                    хранения
                    больших объёмов данных.
                    <br>
                    Флеш-память в них используется в качестве буфера (кэша) небольшого объёма (к
                    примеру, в Seagate Momentus XT от 4 до 8 Гбайт), либо (реже) может быть доступной как отдельный
                    накопитель (англ. dual-drive hybrid systems).
                </div>

                <card class="card" v-for="i in [5, 7]" :imgSrc="cards[i].imgSrc" :title="cards[i].title" />

                <div class="white-round">
                    <p>
                        Однако громоздкие конструктивы и медленные интерфейсы механических жёстких дисков не позволяли
                        раскрыть потенциал флеш-памяти. Начался процесс миниатюризации накопителей. Первоначально
                        отказались
                        от конструктива жёстких дисков, стандартизировав малогабаритные конструктивы mSATA и M.2 SATA
                        (иногда называемый NGFF), но сохранив совместимость с интерфейсом SATA. Следующим шагом стал
                        отказ
                        от медленного интерфейса SATA и переход на быстрый интерфейс PCI Express. Так появились
                        накопители с
                        интерфейсом NVM Express (NVMe) в разнообразных конструктивах, из которых наибольшее
                        распространение
                        получил M.2 NVMe.
                    </p>
                </div>

                <div class="white-round">
                    <h3>Недостатки</h3>
                    <ul>
                        <li>Главный недостаток NAND SSD — ограниченное количество циклов перезаписи. MLC - три-десять
                            тысяч
                            раз, TLC ~ 1000 циклов или менее, SLC - порядка сотен тысяч циклов перезаписи. При ряде
                            вариантов использования, в том числе в бытовых компьютерах,
                            при корректно работающих алгоритмах выравнивания износа, ресурс накопителей обычно серьёзно
                            превышает заявленный производителем гарантийный срок службы, в среднем составляющий 5 лет
                        </li>
                        <li>Цена гигабайта SSD-накопителей, несмотря на продолжающееся на протяжении многих лет быстрое
                            снижение, всё ещё в несколько раз (6-7 для наиболее дешёвой флеш-памяти) выше цены гигабайта
                            HDD (в 2012-2015 годах: менее 0,1$ / ГБ в HDD, от 1 до 0,5-0,4$ / ГБ в SSD).
                            Уравнивание стоимости за единицу объёма SSD и HDD прогнозируется приблизительно к 2019 году
                        </li>
                        <li>Модели накопителей минимального объёма обычно имеют немного более низкую производительность
                            в
                            ряде операций за счёт меньшего параллелизма</li>
                        <li>Возможен выход из строя электронных устройств, в том числе контроллера или отдельных
                            микросхем
                            NAND-памяти либо пассивных компонентов. Среди некоторых моделей выходят из строя до 0,5-2 %
                            SSD
                            накопителей в течение первых лет эксплуатации. В отличие от HDD, выход из строя является
                            внезапным</li>
                        <li>Низкая реальная помехозащищённость операций чтения из ячеек памяти и наличие сбойных ячеек,
                            особенно при изготовлении по самым современным («тонким») техпроцессам, приводит к
                            необходимости
                            использования в контроллерах современных моделей всё более сложных внутренних кодов
                            исправления
                            ошибок. В ряде дешёвых SSD внутренние ошибки кодов
                            коррекции могут приводить к значительному увеличению латентности отдельных операций</li>
                    </ul>
                </div>
            </article>
        </div>


        <!--MOBILE-->


        <article v-else class="flex-column">
            <div class="white-round">
                <p>
                    Наиболее распространённый вид твердотельных накопителей использует для хранения информации
                    флеш-память
                    типа NAND, однако существуют варианты, в которых накопитель создаётся на базе DRAM-памяти,
                    снабжённой
                    дополнительным источником питания — аккумулятором. Помимо собственно микросхем памяти, подобный
                    накопитель содержит управляющую микросхему — контроллер.</p>
            </div>

            <div class="white-round">
                <p>
                    В настоящее время твердотельные накопители используются как в носимых (ноутбуках, нетбуках,
                    планшетах),
                    так и в стационарных компьютерах для повышения производительности. На 2016 год наиболее
                    производительными выступали SSD формата M.2 с интерфейсом NVMe, у которых при подходящем подключении
                    скорость записи/чтения данных могла достигать 3800 мегабайт в секунду.
                    <br>
                    По сравнению с традиционными жёсткими дисками твердотельные накопители имеют меньший размер и вес,
                    являются бесшумными, а также многократно более устойчивы к повреждениям (например, при падении) и
                    имеют гораздо
                    большую скорость производимых операций. В то же время, они имеют в несколько раз большую стоимость в
                    пересчёте
                    на
                    гигабайт и меньшую износостойкость (ресурс записи).
                </p>
            </div>

            <card class="card" v-for="i in [0, 1, 2, 3, 4]" :imgSrc="cards[i].imgSrc" :title="cards[i].title" />

            <div class="white-round">
                <p>
                    SSD представляют собой устройства, хранящие данные в микросхемах вместо вращающихся металлических
                    дисков или магнитных лент. Причина их появления отражает тот факт, что скорость обработки данных в
                    процессоре намного превышает скорость записи данных в HDD. Магнитные диски на протяжении десятилетий
                    доминировали в корпоративном сегменте хранения данных, за это время (с 1950-х) ёмкость носителей
                    выросла в двести тысяч раз, скорость работы процессоров тоже сильно возросла, но скорость доступа
                    к данным изменилась значительно меньше и диски стали «узким местом».
                    <br>
                    Проблему решают твердотельные накопители — они обеспечивают намного большие скорости работы с
                    данными по сравнению с жёсткими дисками. SSD за счёт использования микросхем флеш-памяти по своим
                    характеристикам существенно отличаются от жёстких дисков с магнитными пластинами.
                </p>
            </div>

            <div class="white-round">
                <p>
                    С целью оптимизации использования SSD в 2011 году был разработан интерфейс NVMe — англ. Non-Volatile
                    Memory Express, поддержка которого была добавлена в Windows, начиная только с версии 8.1.
                    Не все материнскиеплаты поддерживают интерфейс NVMe, поэтому всё ещё сохраняет популярность
                    старый интерфейс SATA.
                </p>
            </div>

            <div class="white-round">
                <h3>Основные характеристики твердотельных накопителей</h3>
                <ul>
                    <li>Наименьшее время доступа к данным: от ста до тысячи раз быстрее, чем у механических дисков</li>
                    <li>Высокая скорость, вплоть до нескольких Гб/с для произвольно расположенных данных</li>
                    <li>Высокие значения IOPS благодаря высокой скорости и низкому времени доступа</li>
                    <li>Низкая цена производительности, лучшее соотношение цены к производительности среди всех
                        устройств хранения</li>
                    <li>Высокая надёжность; SSD дают уровень сохранности данных такой же, как другие полупроводниковые
                        устройства</li>
                </ul>
            </div>

            <div class="white-round">
                <h3>Гибридные накопители</h3>
                Существуют также <span class="bold">гибридные жёсткие диски </span> (англ. SSHD, solid-state hybrid
                drive), в которых совмещена
                твердотельная память и механический жёсткий диск. Подобное объединение позволяет воспользоваться
                частью преимуществ флеш-памяти (быстрый произвольный доступ) при сохранении небольшой стоимости хранения
                больших объёмов данных.
                <br>
                Флеш-память в них используется в качестве буфера (кэша) небольшого объёма (к
                примеру, в Seagate Momentus XT от 4 до 8 Гбайт), либо (реже) может быть доступной как отдельный
                накопитель (англ. dual-drive hybrid systems).
            </div>

            <div class="white-round">
                <h3>Внешние накопители</h3>
                <p>
                    Первоначально твердотельные накопители распространились в виде отдельных устройств накопления и
                    переноса
                    информации. Они подключались к компьютерам и цифровым гаджетам через ряд стандартизированных внешних
                    интерфейсов, а конструкция накопителей позволяла неквалифицированному пользователю безопасно
                    манипулировать ими и переносить данные между устройствами. Все эти накопители можно было разделить
                    на
                    две большие группы: с интерфейсом USB («USB-флешки»), преимущественно используемые с компьютерами, и
                    карты памяти, преимущественно используемые в разнообразных электронных гаджетах, например цифровых
                    фотоаппаратах, телефонах и т. п.

                    USB-накопители были отлично стандартизированы и обеспечивали работоспособность на любых устройствах
                    с
                    этим разъёмом. Карты памяти имели большое разнообразие несовместимых конструкций и интерфейсов.
                    Первоначально были популярны CompactFlash, SmartMedia, Memory Stick, MMC, SD.
                </p>
            </div>

            <card class="card" v-for="i in [5, 6, 7]" :imgSrc="cards[i].imgSrc" :title="cards[i].title" />

            <div class="white-round">
                <h3>Встраиваемые накопители</h3>
                <p>
                    По мере роста ёмкости и удешевления флеш-памяти, твердотельная память стала заменять основную
                    долговременную память компьютеров — жёсткие диски. С целью обеспечения взаимозаменяемости с
                    существовавшими технологиями встраиваемые твердотельные накопители стали выпускать в
                    стандартизированных для жёстких дисков конструктивах и с наиболее популярным на тот момент
                    интерфейсом для жёстких дисков. Так появились твердотельные диски типоразмера 2,5" с интерфейсом
                    SATA, которые устанавливались вместо механических жёстких дисков.
                    <br>
                    Однако громоздкие конструктивы и медленные интерфейсы механических жёстких дисков не позволяли
                    раскрыть потенциал флеш-памяти. Начался процесс миниатюризации накопителей. Первоначально отказались
                    от конструктива жёстких дисков, стандартизировав малогабаритные конструктивы mSATA и M.2 SATA
                    (иногда называемый NGFF), но сохранив совместимость с интерфейсом SATA. Следующим шагом стал отказ
                    от медленного интерфейса SATA и переход на быстрый интерфейс PCI Express. Так появились накопители с
                    интерфейсом NVM Express (NVMe) в разнообразных конструктивах, из которых наибольшее распространение
                    получил M.2 NVMe.
                    <br>
                    Несмотря на похожий конструктив накопители M.2 SATA нельзя установить вместо M.2 NVMe и M.2 NVMe
                    нельзя установить вместо M.2 SATA, они несовместимы друг с другом. Внешне их можно различить по
                    количеству вырезов на контактах платы накопителя и соответствующих ключевых вставок на ответном
                    разъёме: у M.2 SATA их два, а у M.2 NVMe — один.
                </p>
            </div>

            <div class="white-round">
                <h3>Преимущества</h3>
                <ul>
                    <li>Количество произвольных операций ввода-вывода в секунду (IOPS) у SSD на порядок выше, чем у
                        жёстких дисков, за счёт возможности одновременного запуска множества операций и более низкой
                        латентности каждой операции</li>
                    <li>Скорость линейного чтения/записи выше, чем у распространённых жёстких дисков, и в ряде операций
                        может быть близка к пропускной способности интерфейсов (SAS/SATA III 600 МБ/с)</li>
                    <li>Малые габариты и вес. Для твердотельных накопителей были разработаны более компактные типовые
                        размеры, например mSATA, NGFF (M.2)</li>
                    <li>Стабильность времени считывания файлов вне зависимости от их расположения или фрагментации</li>
                    <li>Полное отсутствие шума</li>
                    <li>Высокая механическая стойкость (кратковременно выдерживают порядка 1500 g)</li>
                    <li>Низкое энергопотребление</li>
                    <li>Намного меньшая чувствительность к внешним электромагнитным полям</li>
                    <li>Более высокая по сравнению с HDD надёжность при долговременном использовании в качестве
                        загрузочного диска
                    </li>
                </ul>
            </div>


            <div class="white-round">
                <h3>Недостатки</h3>
                <ul>
                    <li>Главный недостаток NAND SSD — ограниченное количество циклов перезаписи. MLC - три-десять
                        тысяч
                        раз, TLC ~ 1000 циклов или менее, SLC - порядка сотен тысяч циклов перезаписи. При ряде
                        вариантов использования, в том числе в бытовых компьютерах,
                        при корректно работающих алгоритмах выравнивания износа, ресурс накопителей обычно серьёзно
                        превышает заявленный производителем гарантийный срок службы, в среднем составляющий 5 лет
                    </li>
                    <li>Цена гигабайта SSD-накопителей, несмотря на продолжающееся на протяжении многих лет быстрое
                        снижение, всё ещё в несколько раз (6-7 для наиболее дешёвой флеш-памяти) выше цены гигабайта
                        HDD (в 2012-2015 годах: менее 0,1$ / ГБ в HDD, от 1 до 0,5-0,4$ / ГБ в SSD).
                        Уравнивание стоимости за единицу объёма SSD и HDD прогнозируется приблизительно к 2019 году
                    </li>
                    <li>Модели накопителей минимального объёма обычно имеют немного более низкую производительность
                        в
                        ряде операций за счёт меньшего параллелизма</li>
                    <li>Возможен выход из строя электронных устройств, в том числе контроллера или отдельных
                        микросхем
                        NAND-памяти либо пассивных компонентов. Среди некоторых моделей выходят из строя до 0,5-2 %
                        SSD
                        накопителей в течение первых лет эксплуатации. В отличие от HDD, выход из строя является
                        внезапным</li>
                    <li>Низкая реальная помехозащищённость операций чтения из ячеек памяти и наличие сбойных ячеек,
                        особенно при изготовлении по самым современным («тонким») техпроцессам, приводит к
                        необходимости
                        использования в контроллерах современных моделей всё более сложных внутренних кодов
                        исправления
                        ошибок. В ряде дешёвых SSD внутренние ошибки кодов
                        коррекции могут приводить к значительному увеличению латентности отдельных операций</li>
                </ul>
            </div>

            <div class="white-round">
                <h3>Перспективы развития</h3>
                <p>
                    Главный недостаток SSD-накопителей на базе флеш-памяти — ограниченное число циклов перезаписи; при
                    развитии технологий изготовления энергонезависимой памяти, возможно, будет устранён путём
                    изготовления носителя информации по другим физическим принципам, например FeRam, ReRAM (resistive
                    random-access memory) и др.
                </p>
            </div>

        </article>
        <scroll-up-button />
    </main>
</template>

<script>
export default {
    data() {
        return {
            cards: [
                { imgSrc: 'ADATA_SSD_SX910.jpg', title: 'SSD с интерфейсом SATA III с переходником для установки в 3,5"-й отсек системного блока' },
                { imgSrc: 'HGST_SN150_NVMe.jpg', title: 'HGST SN150 1,6 ТБ, твердотельный NVMe-совместимый накопитель в форм-факторе платы PCI-E' },
                { imgSrc: 'Vertex_by_OCZ.jpg', title: '2,5" SSD-накопитель 2010 года с интерфейсом SATA II, использовавшийся в ноутбуках и компьютерах' },
                { imgSrc: 'SSD_M2_ADATA.jpg', title: 'SSD в форм-факторе M.2 с интерфейсом SATA (NGFF)' },
                { imgSrc: 'ssd-RalfR-N3S.jpg', title: 'Внешний жёсткий диск с SSD mSATA в комплекте с адаптером на USB 3.0 и корпусом' },
                { imgSrc: 'USB_flash_drive.jpg', title: 'USB-флешка' },
                { imgSrc: 'Memory-card-comparison.jpg', title: 'CompactFlash, SD и microSD карты памяти' },
                { imgSrc: 'Pentax_K10D_with_SanDiskSD_card.jpg', title: 'SD карта памяти в фотоаппарате' },

            ]
        }
    }
}
</script>

<style scoped>
.flex-column {
    display: flex;
    flex-flow: column;
    align-items: center;
    gap: 1.5rem;
    max-width: 40rem;
}

.white-round {
    padding: 1.5rem 2rem;
}

.white-round h3 {
    margin-bottom: 0.5rem;
}

.card {
    width: 100%;
}

ul {
    padding-inline-start: 1rem;
}

ul li {
    margin-bottom: 0.5rem;
}
</style>